[

    {
        "title": "Professional JavaScript for Web Developers",
        "abstract" : "This book is aimed at three groups of readers: Experienced object-oriented programming developers looking to learn JavaScript as it relates to traditional OO languages such as Java and C++; Web application developers attempting to enhance site usability; novice JavaScript developers. Nicholas C. Zakas worked with the Web for over a decade. He has worked on corporate intranet applications used by some of the largest companies in the world and large-scale consumer websites such as MyYahoo! and the Yahoo! homepage. He regularly gives talks at companies and conferences regarding front-end best practices and new technology.",
        "author": [{ "firstName": "Nicholas C.", "lastName": "Zakas"}],
        "url": "http://www.amazon.com/Professional-JavaScript-Developers-Nicholas-Zakas/dp/1118026691/ref=sr_1_7?s=books&ie=UTF8&qid=1385810604&sr=1-7&keywords=javascript",
        "rating": 1,
        "valid": true,
        "tags": [ "Javascript", "Web Programming", "Client-Side"]
    },
    {
        "title": "Theory and Applications for Advanced Text Mining",
        "abstract" : "Due to the growth of computer technologies and web technologies, we can easily collect and store large amounts of text data. We can believe that the data include useful knowledge. Text mining techniques have been studied aggressively in order to extract the knowledge from the data since late 1990s. Even if many important techniques have been developed, the text mining research field continues to expand for the needs arising from various application fields. This book is composed of 9 chapters introducing advanced text mining techniques. They are various techniques from relation extraction to under or less resourced language. I believe that this book will give new knowledge in the text mining field and help many readers open their new research fields.",
        "author": [{ "firstName": "Shigeaki", "lastName": "Sakurai"}],
        "url": "http://www.intechopen.com/books/theory-and-applications-for-advanced-text-mining",
        "rating": 3,
        "valid": true,
        "tags": [ "Text Mining","Web", "Datamining"]
    }


]